tap "homebrew/bundle"
brew "bat"
brew "btop"
brew "cmatrix"
brew "commitizen"
brew "eza"
brew "fzf"
brew "git"
brew "htop"
brew "httpie"
brew "jq"
brew "neovim"
brew "nvm"
brew "pnpm"
brew "ripgrep"
brew "tldr"
brew "tree"
brew "wget"
brew "yarn"
brew "zoxide"
cask "alacritty"
cask "arc"
cask "brave-browser"
cask "docker"
cask "firefox"
cask "font-fira-code"
cask "github"
cask "insomnia"
cask "iterm2"
cask "kitty"
cask "maccy"
cask "postman"
cask "raycast"
cask "rectangle"
cask "spotify"
cask "visual-studio-code"
cask "wezterm"
