tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "nikitabobko/tap"
brew "bat"
brew "btop"
brew "cmatrix"
brew "commitizen"
brew "eza"
brew "fd"
brew "fzf"
brew "git"
brew "htop"
brew "httpie"
brew "jq"
brew "lazygit"
brew "neofetch"
brew "neovim"
brew "nvm"
brew "pnpm"
brew "ripgrep"
brew "starship"
brew "tldr"
brew "tmux"
brew "tree"
brew "wget"
brew "yarn"
brew "zellij"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "felixkratz/formulae/borders"
cask "aerospace"
cask "alacritty"
cask "arc"
cask "docker"
cask "firefox"
cask "font-fira-code"
cask "github"
cask "iterm2"
cask "kitty"
cask "maccy"
cask "obsidian"
cask "raycast"
cask "spotify"
cask "visual-studio-code"
vscode "amediocredev.chandrian-owl"
vscode "dbaeumer.vscode-eslint"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "github.vscode-pull-request-github"
vscode "l13rary.l13-projects"
vscode "ms-azuretools.vscode-docker"
vscode "nrwl.angular-console"
vscode "sdras.night-owl"
vscode "streetsidesoftware.code-spell-checker"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
